# vi: ft=ruby

tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "chef/homebrew-chef"

#
# Terminal Applications
#

# Shell
brew "zsh"

# Editor
brew "neovim"
brew "vim"

# Git
brew "git"

# Git hooks
brew "Arkweid/lefthook/lefthook"

# Encrypted git secrets
brew "transcrypt"

# Remove sensitive files from git history
brew "bfg"

# Search
brew "ripgrep"

# Ruby/Node/Python version manager
brew "asdf"

# NPM/Yarn
brew "yarn"

# Random password generator
brew "pwgen"

# HTTP clients
brew "curl"
brew "httpie"
brew "wget"

# PostgreSQL client
brew "libpq"

# Local SSL Certs
brew "mkcert"
brew "nss" # For Firefox.

# Newer rsync version
brew "rsync"

# Command line CSV querying
brew "csvq"

# AWS EKS Kubernetes
brew "aws-iam-authenticator"
brew "awscli"
brew "gnu-getopt"

# Kubernetes Helm
brew "helm"
brew "helmfile"
brew "skaffold"

# Terraform
brew "terraform"

# Ansible
brew "ansible"
brew "esolitos/ipa/sshpass"

# Cloud Foundry
brew "cloudfoundry/tap/cf-cli"
brew "cloudfoundry/tap/cf-cli@7"

# Heroku
brew "heroku/brew/heroku"

# Rancher
brew "rancher-cli"

# Python package locking
brew "poetry"

# Inspect docker image sizes
brew "dockviz"

# Better diff for "git diff"
brew "diff-so-fancy"

# Open Build Service
brew "osc"

# Watch files for changes
brew "watch"

# Minio client (local S3-compatible API)
brew "minio-mc"

# For linux version of `column` to fix handling of longer output:
# https://github.com/larkery/zsh-histdb/pull/31
brew "util-linux"

# JSON tools
brew "jq"
brew "jd"

# GitHub Markdown previewing
brew "grip"

# Templating
brew "gomplate"

#
# Desktop Applications
#

# Browsers
cask "firefox"
cask "google-chrome"

# Database tool
cask "dbeaver-community"

# Docker
cask "docker"

# VirtualBox
cask "virtualbox"
cask "virtualbox-extension-pack"

# Editor
cask "vimr"
cask "macvim"

# Firewall
cask "little-snitch"
cask "micro-snitch"

# API documentation
cask "devdocs"

# Optimize/compress images
cask "imageoptim"

# Search/application launcher
cask "alfred"

# Menu bar organizer
cask "bartender"

# REST/API client
cask "insomnia"

# GPG signing
cask "gpg-suite"

cask "visual-studio-code"

# Chef
cask "chef-workstation"

# Document scanner
cask "fujitsu-scansnap-home"

# Java
cask "oracle-jdk"

# SFTP/S3 browser
cask "cyberduck"

# Redis tool
cask "another-redis-desktop-manager"

# Identify disk usage
cask "omnidisksweeper"

# VM testing
cask "vagrant"

#
# App Store Applications
#

# Password manager
# mas "1Password 7", id: 1333542190

# Prevent system sleeping
mas "Amphetamine", id: 937984704

# Chat
mas "Slack", id: 803453959

# Plain text copy/paste
mas "Paste Plain Text", id: 803453959

# Unzip
mas "The Unarchiver", id: 425424353

# Break reminder
mas "Time Out - Break Reminders", id: 402592703

# Safari content blocker
mas "Wipr", id: 1320666476

# Development
mas "Xcode", id: 497799835
