tap "homebrew/cask"
tap "chef/homebrew-chef"

brew "Arkweid/lefthook/lefthook"
brew "asdf"
brew "git"
brew "httpie"
brew "neovim"
brew "ripgrep"
brew "rsync"
brew "zsh"

cask "alfred"
cask "bartender"
cask "chef-workstation"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "insomnia"
cask "little-snitch"
cask "micro-snitch"
cask "oracle-jdk"
cask "vimr"

mas "1Password 7", id: 1333542190
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Time Out - Break Reminders", id: 402592703
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
